<template>
  <div class="post">
    <h2 class="tac fwb">用户注册协议</h2>
    <div class="post-content">
      <p style="text-indent: 2em;">
        本《用户注册协议》是您（以下亦称“用户”）与作者（以下称“我们”）之间缔结的， 在您使用作者产品和网络服务（以下合称“数据中台 产品与服务”）功能之前签署的具有法律约束力的协议。该平台使用了大量的开源组件以及数据库厂商提供的
        接口，如若牵涉任何法律纠纷 请联系 <a  style="color:red" href="mailto:814780613@qq.com&subject=侵权反馈&body=你提供的...侵权"><i class="fa fa-github"></i>作者</a>删除相关的业务,作者不承担任何法律责任
      </p>
      <h3>1. 重要须知——在签署本协议之前，我们严正提醒用户：</h3>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">1.1. 您应认真阅读（若您为未成年人，应当在监护人陪同下阅读）并充分理解本《用户注册协议》中的各项条款，包括免除或者限制我们责任的条款、用户的权利进行限制的条款，以及约定适用法律和争议管辖的条款。</span>如您对本协议条款有任何疑问，可以向作者咨询。</p>
      <p style="text-indent: 2em;">1.2. 除非您接受本协议，否则用户无权也不应接受针对注册用户提供的数据中台产品与服务，您可以退出本次注册。<span style="text-decoration: underline; font-weight: bold;">用户点击“同意并注册账号”、“接受”等含义的按钮，或实际使用数据中台 对注册用户提供的服务，视为用户已完全接受并签署本协议。</span></p>
      <p style="text-indent: 2em;">1.3. 本协议一经签署，具有法律效力，请您慎重考虑是否接受本协议。</p>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">1.4. 在您签署本协议之后，本协议文本可能因国家政策、产品功能和形态、运营方案以及履行本协议的环境发生变化而进行修改。</span>修改后的协议发布在本网站／软件上，您可随时查看。<span style="text-decoration: underline; font-weight: bold;">若您对修改后的协议有异议的，请立即停止登录并停止使用 产品与服务。若您登录或继续使用 产品，视为认可修改后的协议并同意受其约束。</span></p>
      <h3>2. 关于 账号</h3>
      <p style="text-indent: 2em;">2.1 按照法律、政策的要求，注册用户须配合完成身份信息实名认证。<span style="text-decoration: underline; font-weight: bold;"> 账号仅限于注册用户本人使用，禁止赠与、借用、租用、转让或售卖与任何第三方。 如果我们发现 账号实际使用者并非账号注册人，有权在未经通知的情况下回收该账号，而无需向该账号使用者或注册人承担法律责任，由此带来的包括并不限于用户通讯中断、用户资料清空等损失由用户自行承担。</span></p>
      <p style="text-indent: 2em;">2.2. 用户保证其在使用 产品时填写的身份及其他信息均是真实的，<span style="text-decoration: underline; font-weight: bold;">任何非法、不真实、不准确的用户信息所产生的责任由用户承担。</span>用户应按照及时、详尽、真实、准确的要求在其信息发生变化时更新注册资料。<span style="text-decoration: underline; font-weight: bold;">因用户的注册信息不真实而引起的问题，以及对问题发生所带来的后果，我们不负任何责任。</span></p>
      <h3>
        3. 用户不得从事以下行为：
      </h3>
      <p style="text-indent: 2em;">3.1. 利用 产品与服务发表、传送、传播、储存危害国家安全、国家统一、社会稳定的内容，或者侮辱、诽谤、色情、暴力、引起他人不安及任何违反国家法律法规或政策的内容。</p>
      <p style="text-indent: 2em;">3.2. 利用 产品与服务发表、传送、传播、储存侵害他人知识产权、商业秘密权、肖像权、隐私权等合法权益的内容。</p>
      <p style="text-indent: 2em;">3.3. 进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器／账户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试构成 产品与服务的软件系统／网站／网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏前述软件系统／网站／网络的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造数据包名称或部分名称或者内容。</p>
      <p style="text-indent: 2em;">3.4. 进行任何破坏 产品与服务公平性或者其他影响 产品与服务正常秩序的行为，如使用外挂或者其他的作弊或修改软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众。</p>
      <p style="text-indent: 2em;">3.5. 进行其他任何违法或侵犯其他个人、公司、社会团体、组织的合法权益的行为，以及任何违反 产品与服务的独立协议，或者违反平台规则和公告的行为。</p>
      <h3>4. 用户风险提示</h3>
      <p style="text-indent: 2em;">4.1. 用户须明白并接受：<span style="text-decoration: underline; font-weight: bold;">在使用 产品与服务时，可能存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为，或侵犯他人权利（包括知识产权）的匿名或冒名的信息的风险，该等风险并非我们造成，用户须承担以上风险。 对用户因此遭受的，以及任何因用户不正当或非法使用 产品与服务而产生的直接、间接、偶然、特殊及后续的损害，我们在法律允许范围内不承担任何责任。</span></p>
      <p style="text-indent: 2em;">4.2. 用户使用 产品与服务必须遵守国家有关法律法规和政策等。用户应维护国家利益，保护国家安全，言行不应违背公序良俗和正确的价值观。 用户应严格遵守本协议、平台规则和公告，对于用户违法或违反本协议使用（包括但不限于发表言论、传送内容等）而引起的一切责任，由用户负全部责任。</p>
      <p style="text-indent: 2em;">4.3  的产品与服务同大多数软件产品和网络服务一样，如果用户安全意识薄弱、行为不慎，可能会面对各种安全问题的滋扰，包括但不限于：</p>
      <p style="text-indent: 4em;">1）透露个人资料后，被不法分子利用，造成现实生活中的骚扰；</p>
      <p style="text-indent: 4em;">2）被他人哄骗、破译密码，造成经济损失；</p>
      <p style="text-indent: 4em;">3）轻信不法分子编造的谎言，被诈骗钱财或遭受其他损失；</p>
      <p style="text-indent: 4em;">4）下载安装的其它软件中含有病毒、“特洛伊木马”等恶意程序，威胁个人计算机或其他计算设备上的信息和数据的安全，继而威胁对 产品与服务的使用。</p>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">对于发生上述情况的，用户应当自行承担责任。</span>如果用户发生上述情况导致我们或其其他用户可能遭受威胁的，我们有权中止或终止继续向该用户提供产品与服务，拒绝该用户接入，由此造成该用户损失的，用户需自行承担。</p>
      <p style="text-indent: 2em;">4.4. 用户须明白并同意：<span style="text-decoration: underline; font-weight: bold;">我们为了服务整体运营的需要，有权在公告通知后修改或中断、中止或终止其产品与服务而无需事先向您通知。我们就此无须向您或第三方承担任何赔偿责任。</span></p>
      <p style="text-indent: 2em;">4.5. 用户须明白并同意：互联网技术的快速发展和受多方因素影响的特性，可能导致政府监管政策变化、基础电信服务中断、病毒入侵、黑客攻击、服务器系统崩溃或者其他现今技术无法预见、无法避免和无法快速解决的风险发生。 上述风险可能导致 产品与服务中断和／或数据丢失等，我们会尽量尝试修复，<span style="text-decoration: underline; font-weight: bold;">但用户须最终承担此类非人为因素引起的损失。</span></p>
      <h3>5. 知识产权</h3>
      <p style="text-indent: 2em;">5.1.  产品与服务的各个组成部分，包括但不限于我们运营的网站、网页应用、桌面和移动端软件及其内含的文字、图片、视频、音频等元素，我们使用的商标、服务标志、标识， 以及实现该等产品与服务所使用的专利，除另有明确约定外，由我们享有著作权、商标专用权和专利权等知识产权；本协议的任何内容，以及用户在使用 产品与服务过程中的任何交互行为，不应视为向用户授予、许可、转让该等知识产权。</p>
      <p style="text-indent: 2em;">5.2. 用户不得对 产品与服务涉及的相关网页、应用、软件等受知识产权保护的内容进行反向工程、反汇编、反向编译、嗅探、跟踪、破解等操作。</p>
      <p style="text-indent: 2em;">5.3. 用户使用 产品与服务，只能在本协议以及相应的授权许可协议授权</p>
      <p style="text-indent: 2em;">5.4. 用户在使用 产品与服务时发表并上传的文字、图片、视频、软件等用户原创的内容，此部分内容的著作权归用户所有， 但用户的发表、上传行为视为对我的一项非独占性（除非另有明确约定）、不可撤回的、无需支付费用的、永久性的授权，该授权可分授权及转授权。我们可将前述内容在 产品与服务上使用，可再次编辑后使用，也可以由我们授权给合作方使用。</p>
      <p style="text-indent: 2em;">5.5. 若 产品与服务提供的信息或其他用户上传、存储、传播的信息存在侵犯您或第三人的知识产权的情况，我们提供投诉通道，非版权投诉事项亦可参照该指引作出投诉。</p>
      <h3>6. 隐私保护</h3>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">6.1. 请用户提高安全意识，注意勿在使用 产品与服务时透露自己的各类财产帐户、银行卡、信用卡、第三方支付账户及对应密码、个人身份信息、家庭成员信息等重要资料，否则由此带来的任何损失由用户自行承担。</span>我们的工作人员不会以任何方式索要您的账号密码。</p>
      <p style="text-indent: 2em;">6.2. 用户的注册信息作为 产品的商业秘密进来保护。但用户同时明白，互联网的开放性以及技术更新非常快，<span style="text-decoration: underline; font-weight: bold;"></span>非我们可控制的因素导致用户信息泄漏的，在法律允许的范围内我们不承担责任。</p>
      <p style="text-indent: 2em;">6.3. 用户在使用 产品与服务时不可将自认为隐私的信息发表、上传至 产品与服务平台，也不可将该等信息通过 的服务传播给其他人。若用户执意作出该等行为引起隐私泄漏，由用户自行承担责任。</p>
      <p style="text-indent: 2em;">6.4.  在提供服务时可能会搜集用户个人信息，我们会明确告知用户，通常信息仅限于用户姓名、性别、年龄、出生日期、身份证号、家庭住址、教育程度、公司情况、所属行业、兴趣爱好等。 出于更好地提供服务所需，我们还可能记录并分析用户的技术信息和使用状况，例如用户设备标识（例如IMEI码、MAC地址等）、登录及登出时间、登录所在的IP地址、地理位置、系统版本等等。 用户在此授权我们取得并合理使用上述信息。我们将妥善保管该等信息，未经用户同意，不得公开或向第三方提供，但法律要求的披露，或者无法还原至个人原始数据（例如基于“大数据”所做的统计数据）方式的披露除外。</p>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">6.5. 就下列相关事宜的发生，在法律允许的范围内，我们不承担任何法律责任：</span></p>
      <p style="text-indent: 4em;">1）我们根据法律规定或相关政府、司法机关的要求提供您的个人信息；</p>
      <p style="text-indent: 4em;">2）由于用户将用户密码告知他人或与他人“共享”账户，由此导致的任何个人信息的泄漏，或其他非因我们原因导致的个人信息的泄漏；</p>
      <p style="text-indent: 4em;">3）任何由于黑客攻击、电脑病毒侵入、他人非法行为造成的信息泄漏；</p>
      <p style="text-indent: 4em;">4）因不可抗力导
        ：，该页面应视为本协议的组成部分。</p>
      <h3>7、其他条款</h3>
      <p style="text-indent: 2em;"><span style="text-decoration: underline; font-weight: bold;">7.1. 本协议的签署、解释、履行和争议解决，均适用中华人民共和国法律，并明确排除其冲突法规范的适用。</span></p>

    </div>
    <div align="center">
      <button type="submit" class="btn  btn-danger" @click="index()">回到首页</button>
    </div>
  </div>
</template>

<script>
  import common from '../config/common'
  export default {
    name: 'index',
    data() {
      return {
        agree:true,
        loginForm: {
          username: '',
          password: ''
        },
      }
    },
    methods: {
      index() {
        this.$router.push({path: "/"});
      },

    },
    created(){
    }
  }
</script>
<style>
  .tac {
    text-align: center;
    margin-bottom: 40px;
  }

  .fwb {
    font-weight: bold;
  }
  p ,h2,h3{
    color: white;
  }
</style>
